<style type="text/scss" lang="scss" scoped>
  pre {
    white-space: pre-wrap;
    word-wrap: break-word;
  }
</style>

<template>
  <el-dialog
    title="合同预览"
    :visible.sync="visible"
    size="large"
    top="10%"
    @close="ok">
    <div>
      <pre>
甲方：

乙方：

甲乙双方在平等、互利的基础上，遵循自愿、公平和诚信的原则，依照《中华人民共和国合同法》及其他有关法律、行政法规，经友好协商，达成如下协议：

第一条 合作范围及约定

<el-table
  :data="prTable"
  border
  class="wp100">
  <el-table-column
    prop="prCode"
    label="物料编码">
  </el-table-column>
  <el-table-column
    prop="prDesc"
    label="物料描述">
  </el-table-column>
  <el-table-column
    prop="num"
    label="数量">
  </el-table-column>
  <el-table-column
    prop="priceWithRate"
    label="含税单价">
  </el-table-column>
  <el-table-column
    prop="rate"
    label="税率">
  </el-table-column>
  <el-table-column
    prop="remark"
    label="备注">
  </el-table-column>
</el-table>

合同生效期间：2017.01.01至2017.12.31

甲方保证上述所定产品为最终用户实际所定产品，并保证其提供的最终用户信息（包括本合同及与本合同相关的其他订单资料等）是正确的，如果因甲方违反了上述保证义务而引起的任何经济或法律纠纷，以及其他不良后果将由甲方自行承担。甲方保证不因最终用户没有或延迟向甲方付款而不向或延迟向乙方付款。

第二条 付款方式

<el-table
  :data="priceTable"
  border
  class="wp100">
  <el-table-column
    prop="type"
    label="类型">
  </el-table-column>
  <el-table-column
    prop="money"
    label="金额">
  </el-table-column>
  <el-table-column
    prop="date"
    label="时间">
  </el-table-column>
  <el-table-column
    prop="percent"
    label="占比">
  </el-table-column>
  <el-table-column
    prop="remark"
    label="备注">
  </el-table-column>
</el-table>

合同含税总金额为200000 （CNY 200000元）
保证金两万元整（CNY 20000元），占比10%。保证金支付时间为2018.12.31.

甲方增值税专用开票信息：
公司名称：
统一社会信用代码：
注册地址：
经营地址：
联系电话：
银行账号：
开 户 行：

乙方指定甲方汇款的账户为：
乙方：
银行账号：
开户行：
联系人：
联系地址：
联系电话：
E-mail:

验收方式：
由甲乙双方共同验收。乙方向甲方说明商品的配置，型号，通电调试，符合使用说明书中的配置和产品质量状况，经甲方确认后，验收完毕。

第三条 乙方义务

3.1 乙方提供潜在客户名单后，应当继续积极推动并参与甲方与潜在客户的接洽。
3.2 乙方应在其拥有的客户资源中初步遴选房地产、家居、建材等行业的客户，并向甲方提供一份初步的潜在客户名单。乙方应利用自身资源尽量缩小该份名单的范围，避免双方由于名单过于宽泛而降低效率、浪费资源。
3.3 乙方在将项目报备甲方后应积极配合甲方推动业务，并定期与甲方沟通项目进展，若出现项目停滞超过1个月无进展（若确有特殊情况，需在定期沟通的会议上向甲方提出，并获得甲方允许）或乙方已放弃的项目，甲方有权进行重新分配。

第四条 违约责任

4.1 乙方由于自身原因，不能按本合同规定的条款进行合作的，甲方可书面要求乙方限期改善，如超过改善期限，乙方工作仍未能达到合同规定的标准，甲方有权解除本合同。

第五条 保密条款
5.1 未经对方许可，任何一方不得将涉及对方的商业秘密信息透露给本合同之外的第三方，信息包括但不限于企业文档、企业数据等。
5.2 未经甲方同意，乙方不得将甲方的业务资料提供给本合同之外的第三方进行展示、查看和使用等。
5.3 上述保密义务的期限为自合同签署之日起壹拾年，不受本合同期限结束的约束，乙方违反本条保密约定，应按本合同约定的项目推荐总金额的1%向甲方支付违约金。

第六条 不可抗力

6.1 由于地震、台风、水灾、火灾、战争、法律法规、意外事故以及其他不可抗力事件，致使合同无法履行时，无法履行合同义务的一方应在3个工作日内将不能履行合同的事实通知另一方，并于10个工作日内提供不可抗力发生的详情及本合同不能履行、或者部分不能履行、或者需要延期履行的理由的有效证明文件，此文件应由不可抗力事由发生地区的处理机关出具。则上述无法履行应不被视为违约；
6.2 根据不可抗力事由对履行本合同影响的程度，由双方协商延长履行期，或者部分免除本合同的履行义务。如该影响持续超过60日，双方均有权以书面通知对方终止本合同。

第七条 合同的终止

7.1 合同任何一方根本性的或严重地违反本合同约定的主要义务，另一方应给予其不少于60日的合理期限，以便违约方纠正其违约行为。若违约方在前述期限内仍未纠正其违约行为，则守约方可以书面通知违约方解除合同，合同在书面通知到达违约方之日解除；
7.2 双方同意在双方协商达成一致的终止合同意见后，可以书面解除本合同；
7.3 甲乙双方的责任和义务履行完毕后合同自动终止。
7.4 即使本合同终止，合同中的知识产权、保密及其他根据条款的法律性质应当延续的条款继续有效。

第八条 适用法律及争议解决方式

8.1 本合同的订立、效力、履行和解释均受中华人民共和国法律的管辖；
8.2 双方应本着互谅互解的原则，协商解决因本合同引起的或与本合同有关的任何争议；协商解决不成的，双方均同意将前述争议提交甲方注册地法院诉讼解决。

第九条 合同生效

9.1 若本合同中的任何条款或规定被认为无效或不具有强制执行力，则该条款的无效性或不可执行性不得影响其它条款的效力和执行；
9.2 本合同自双方代表签字并加盖公章之日起成立并生效；本合同壹式肆份，双方各执贰份，具有同等法律效力；
9.3 本合同生效后，无论甲方或乙方的名称、组织形式、企业性质、经营范围、注册资本、投资者等发生任何变更，甲方或乙方应继续或要求其权利义务的继承人恪守并履行其在本合同项下之相关义务；
9.4 双方承认并同意将本合同文本作为双方合同完整的和唯一的表述，以取代此前双方有关此项目内容的所有口头、书面、及其他通信方式中的表述；
9.5 对本合同进行的任何更改和补充，均应由双方代表签字并加盖公司公章方有效，所有更改、补充文件将成为合同不可分割的部分；

第十条  其它约定

10.1 任何不在本合同书面约定条款范围内的口头承诺对甲乙双方不具备约束力。
10.2 双方即日起共同组建“红星集采项目组”（以下简称项目组），客户信息通过项目组专人邮箱进行交互传递。双方信息包括但不仅限于业务进展、业务问题、解决方案和业务数据等。双方都有保守客户秘密，共同维护业务信息安全的责任和义务。项目组的一般业务工作包括：客源评估、专人跟进、业务电话、工作会议（每周，或面临重要业务环节，召开相关人员会议，进行业务沟通与情况分析）；实地研/访（双方可一同展业）、合同督导、后续服务等流程。
10.3 本协议不代表双方之间存在合资、合伙关系，本协议的一方亦无权代表另一方从事任何活动。除了为履行本协议的合作事项外，任何一方未经另一方事先书面同意，不得使用另一方的品牌和名义，单独对外进行商业拓展、欺诈活动或其他各种非法行为，若乙方违反本条约定的须按本合同约定的项目推荐总金额的1%支付违约金，并承担相应的法律责任。
10.4 乙方除向其他方出示本合同所附合作证明外，乙方及其员工不得以其他任何方式使用红星美凯龙相关无形资产（包括但不限于在名片、文件、牌匾等载体上印制红星美凯龙商标、或对外自称是红星美凯龙工作人员等），如有违约行为，甲方有权通知乙方尽快纠正，未在甲方通知期限内纠正违约行为的，乙方应向甲方支付违约金1万元（由于侵犯知识产权所带来的商誉损失等难以举证和计量，双方特别同意本条所约定的违约金数额合理并具有强制执行力）。
10.5 甲方在不违反国家相关部门规定和公司规章制度的前提下，可酌情根据项目特点和发展优势，实施项目绿色通道办法，如合作定制、个性化服务等。





甲方：                                        乙方：

法定代表人：                                  法定代表人：

日期：                                        日期：
      </pre>
    </div>
    <div slot="footer">
      <el-button type="primary" @click="ok">确 定</el-button>
    </div>
  </el-dialog>
</template>

<script>
  export default {
    props: {
      visible: Boolean,
      data: {
        default() {
          return {}
        }
      }
    },
    data() {
      return {
        prTable: [],
        priceTable: []
      }
    },
    methods: {
      ok() {
        this.$emit('update:visible', false)
      }
    }
  }
</script>
